In [2]:
import pandas as pd
import numpy as np

In [3]:
#2. Create the DataFrame with the following values:

raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [4]:
#3. Assign it to a variable called regiment.
Regiment=pd.DataFrame(raw_data,columns=['regiment','company','name','preTestScore','postTestScore'])

In [5]:
#4. What is the mean preTestScore from the regiment Nighthawks?
Regiment.groupby('regiment')['preTestScore'].mean()[["Nighthawks"]]

regiment
Nighthawks    15.25
Name: preTestScore, dtype: float64

In [6]:
#5. Present general statistics by company
Regiment.groupby('company').describe().transpose()

company                    1st        2nd
preTestScore  count   6.000000   6.000000
              mean    6.666667  15.500000
              std     8.524475  14.652645
              min     2.000000   2.000000
              25%     3.000000   2.250000
              50%     3.500000  13.500000
              75%     4.000000  29.250000
              max    24.000000  31.000000
postTestScore count   6.000000   6.000000
              mean   57.666667  67.000000
              std    27.485754  14.057027
              min    25.000000  57.000000
              25%    34.250000  58.250000
              50%    66.000000  62.000000
              75%    70.000000  68.000000
              max    94.000000  94.000000

In [7]:
#6. What is the mean of each company's preTestScore?
Regiment.groupby('company')['preTestScore'].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

In [8]:
#7. Present the mean preTestScores grouped by regiment and company
Regiment.groupby(['regiment','company'])['preTestScore'].mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [9]:
#8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [10]:
#9. Group the entire dataframe by regiment and company
reg_com=Regiment.groupby(['regiment','company'])
reg_com.first()

                      name  preTestScore  postTestScore
regiment   company
Dragoons   1st       Cooze             3             70
           2nd      Ryaner            24             94
Nighthawks 1st      Miller             4             25
           2nd         Ali            31             57
Scouts     1st       Sloan             2             62
           2nd       Riani             2             62

In [12]:
#10. What is the number of observations in each regiment and company
Regiment.groupby(['regiment','company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [14]:
#11. Iterate over a group and print the name and the whole data from the regiment
reg=Regiment.groupby('regiment')
for name, group in reg:
    print(name)
    print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70